#Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список.
#Тобто, в результаті повинен вийти список із 2-х списків.
#Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.
#Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.
#Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній,
#у списку парна кількість елементів і в списку непарна кількість елементів.
#Приклади:
#Було => стало
#[1, 2, 3, 4, 5, 6] => [[1, 2, 3], [4, 5, 6]]
arr = []
if len(arr) % 2 == 0:
    x = int(len(arr)/2)
    arr1 = arr[:x]
    arr2 = arr[x:]
    arr_res = [arr1, arr2]
else:
    x = int(len(arr) / 2 + 1)
    arr1 = arr[:x]
    arr2 = arr[x:]
    arr_res = [arr1, arr2]

