#Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список.
#Тобто, в результаті повинен вийти список із 2-х списків.
#Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.
#Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.
#Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній,
#у списку парна кількість елементів і в списку непарна кількість елементів.
arr = [1, 2, 3, 4, 5, 6, 7]
x = int(len(arr)/2)
if len(arr) % 2 == 0:
    arr_res = [arr[:x], arr[x:]]
else:
    arr_res = [arr[:x+1], arr[x+1:]]
print(arr_res)

